In [1]:
import pandas as pd

In [2]:
import seaborn as sbn

In [3]:
df = sbn.load_dataset("iris")

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [9]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [10]:
df.index

RangeIndex(start=0, stop=150, step=1)

In [11]:
df["sepal_length"]

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [12]:
names = ["Ellie",  "Elton", "Ellertone"]

In [13]:
ages = [23, 21, 24]

In [14]:
d  = {
    "name": names,
    "age": ages
}

In [15]:
d

{'name': ['Ellie', 'Elton', 'Ellertone'], 'age': [23, 21, 24]}

In [16]:
pd.DataFrame(d)

        name  age
0      Ellie   23
1      Elton   21
2  Ellertone   24

In [17]:
import numpy as np

In [18]:
data = np.random.randint(1, 11, (10, 5))

In [19]:
data

array([[ 3,  3,  7,  8,  6],
       [ 9, 10, 10,  6,  2],
       [ 1,  5,  5,  1,  7],
       [ 2,  7,  7,  8,  8],
       [ 3,  6,  6,  2,  6],
       [10,  1,  8,  7, 10],
       [ 9, 10,  9,  1,  8],
       [ 2,  9,  4,  5,  6],
       [ 6,  5,  8,  7,  9],
       [ 6,  2,  7,  2,  9]])

In [21]:

marks = pd.DataFrame(data, columns=["a", "c","d", "f", "g"])

In [22]:
marks

    a   c   d  f   g
0   3   3   7  8   6
1   9  10  10  6   2
2   1   5   5  1   7
3   2   7   7  8   8
4   3   6   6  2   6
5  10   1   8  7  10
6   9  10   9  1   8
7   2   9   4  5   6
8   6   5   8  7   9
9   6   2   7  2   9

In [23]:
marks["Bio" ] = 0

In [24]:
marks

    a   c   d  f   g  Bio
0   3   3   7  8   6    0
1   9  10  10  6   2    0
2   1   5   5  1   7    0
3   2   7   7  8   8    0
4   3   6   6  2   6    0
5  10   1   8  7  10    0
6   9  10   9  1   8    0
7   2   9   4  5   6    0
8   6   5   8  7   9    0
9   6   2   7  2   9    0

In [27]:

df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [31]:
marks.sort_values(["a"])

    a   c   d  f   g  Bio
2   1   5   5  1   7    0
3   2   7   7  8   8    0
7   2   9   4  5   6    0
0   3   3   7  8   6    0
4   3   6   6  2   6    0
8   6   5   8  7   9    0
9   6   2   7  2   9    0
1   9  10  10  6   2    0
6   9  10   9  1   8    0
5  10   1   8  7  10    0

In [35]:
marks.iloc[::2]

   a   c  d  f  g  Bio
0  3   3  7  8  6    0
2  1   5  5  1  7    0
4  3   6  6  2  6    0
6  9  10  9  1  8    0
8  6   5  8  7  9    0